app/views/events/_form.html.erb

    <%= f.label :track_id %><br />
    <%= f.select :track_id, Track.all.map{|t| [t.name, t.track_id]} %>
---
SELECT "tracks".* FROM "tracks"

    <%= f.label :room_id %><br />
    <%= f.select :room_id, Room.all.map{|r| [r.local, r.room_id]} %>
---
SELECT "rooms".* FROM "rooms"

    <%= f.label :user_id %><br />
    <%= f.select :user_id, User.all.map{|u| [u.name, u.user_id]} %>
---
SELECT "users".* FROM "users"

    <%= f.label :document_id %><br />
    <%= f.select :document_id, Document.all.map{|d| [d.title, d.document_id]} %>
---
SELECT "documents".* FROM "documents"