app/views/floors/_form.html.erb

     <%= f.label :building_id %><br />
     <%= f.collection_select :building_id, Building.all, :id, :name %>
---
SELECT "buildings".* FROM "buildings"