app/views/rooms/_form.html.erb

    <%= f.label :floor_id %><br />
    <%= f.collection_select :floor_id, Floor.all, :id, :name %>
---
SELECT "floors".* FROM "floors"