app/controllers/documents_controller.rb

  def create
    @document = Document.new(params[:document])
    # @document.save

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("created_at", "link", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def destroy
    @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]