app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user = User.find(params[:user_id])
    @note = @user.notes.find(params[:id])

INSERT INTO "notes" ("created_at", "shared", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 01 Jun 2013 16:27:03 UTC +00:00], ["shared", true], ["text", "ddfnjfnjnsfnj"], ["title", "dhfbdh"], ["updated_at", Sat, 01 Jun 2013 16:27:03 UTC +00:00], ["user_id", 1]]
---
  def create
    @user = User.find(params[:user_id])
    @note = @user.notes.create(params[:note])