app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @room = Room.find(params[:id])

INSERT INTO "rooms" ("capacity", "coordX", "coordY", "created_at", "event_id", "floor_id", "name", "plan", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @room = Room.new(params[:room])

    respond_to do |format|
      if @room.save