app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("aboutme", "available", "contact", "created_at", "document_id", "email", "facebook", "homepage", "imageurl", "institution", "linkedin", "meeting_id", "name", "note_id", "password", "sex", "twitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)